{"meta":{"title":"Devyh Archive","subtitle":"매일 기록하는 작은 성장들","description":"개발에 관한 사소한 것들","author":"Devyh","url":"http://yoursite.com"},"pages":[],"posts":[{"title":"Android에서 Boost 라이브러리 사용하기 (CMake 빌드)","slug":"androidBoost","date":"2018-04-17T16:39:53.000Z","updated":"2018-04-17T16:51:30.000Z","comments":true,"path":"2018/04/18/androidBoost/","link":"","permalink":"http://yoursite.com/2018/04/18/androidBoost/","excerpt":"","text":"Android + NDK + Boost (using CMake) &ensp; 안드로이드 네이티브 프로그래밍을 하다보면 Boost의 강력한 기능이 필요한 경우가 종종 발생한다. 특히 네이티브 레벨에서 직렬화(Serialization)를 수월하게 수행하기 위해서는 Boost의 serialization 라이브러리가 매우 유용하다. 구글링을 통해서 Boost 포팅 방법을 검색하면 대체로 ndk-build 방식의 튜토리얼들만 볼 수 있다.&ensp;그러나 Android Studio를 사용하는 입장에서 CMake 빌드 방식을 이용하여 네이티브 레벨 개발을 하면 편리한 점이 많다. 매번 ndk-build를 실행해 라이브러리 파일을 만들 필요가 없고 별다른 설정 없이도 C++ 코드도 실시간 문법 에러 체크, 자동완성 등의 이점을 볼 수 있기 때문에 CMake 방식에 익숙해지는 것이 좋다. 본 포스팅에서는 CMake 빌드 환경에서 안드로이드 네이티브 프로그래밍 시 Boost를 사용하는 방법에 대한 튜토리얼을 진행한다. 튜토리얼 진행 환경IDE : Android Studio 3.0.1SDK : min 15, target 26NDK : android-ndk-r14b Boost for Android 다운로드&ensp; Boost-for-Android Github에서 직접 소스를 받아 빌드를 할 수 있지만 Boost를 직접 빌드하는 작업 자체에 상당히 많은 시간이 필요하다. 굳이 직접 Boost 소스 코드를 빌드할 이유가 없다면 미리 빌드 된 Prebuild 파일을 받는 것이 좋다.&ensp; Prebuild 라이브러리의 repository를 보면 세 가지 버전의 Boost가 있는 것을 확인할 수 있다. 다운로드 이후 본인이 사용하고자 하는 버전의 Boost만 사용하면 된다. 본 튜토리얼에서는 1.53.0 버전을 사용한다. C++ 지원 Android 프로젝트 생성 강좌와 직접적인 관련이 없는 부분은 간단한 서술로 대체합니다.NDK, CMake, LLDB 등 네이티브 개발에 필요한 사항은 설치 되어 있다고 가정합니다. &ensp; Android Studio에서 프로젝트를 생성할 때 C++을 지원하는 프로젝트로 생성한다. 이클립스를 사용하던 때와 달리 자동으로 JNI 부분에 대한 각종 설정을 수행하고 샘플 코드를 제공한다. 또한 CMake 빌드 방식을 사용하기 때문에 다양한 편의 기능으로 전보다 쉽게 코드를 작성할 수 있다. 프로젝트에 Boost 라이브러리 추가&ensp; 빌드 된 Boost 라이브러리를 안드로이드 프로젝트에 추가한다. 본인의 개발 스타일에 따라 폴더 구조를 다르게 가져갈 수 있지만 본 강좌에서는 서드파티 라이브러리는 따로 관리할 수 있도록 나눠서 추가한다. Boost 라이브러리 링크&ensp; 외부 라이브러리를 가져왔으면 이를 프로젝트에 링크해야 정상적으로 사용할 수 있다. 이전의 ndk-build 방식에서는 Android&#46;mk 파일을 수정함으로서 라이브러리를 링크했지만 CMake 방식에서는 CMakeLists.txt 파일을 수정함으로서 링크가 가능하다.1234567891011121314151617cmake_minimum_required(VERSION 3.4.1)############### Boost ###############set(BOOST_ROOT $&#123;PROJECT_SOURCE_DIR&#125;/src/main/3rdparty/boost)set(BOOST_LIBS_PATH $&#123;BOOST_ROOT&#125;/lib/$&#123;ANDROID_ABI&#125;/lib)set(BOOST_INC_PATH $&#123;BOOST_ROOT&#125;/include)file(GLOB BOOST_LIBS $&#123;BOOST_LIBS_PATH&#125;/*.a)include_directories($&#123;BOOST_INC_PATH&#125;)#####################################add_library(native-lib SHARED src/main/cpp/native-lib.cpp)find_library(log-lib log)target_link_libraries(native-lib $&#123;BOOST_LIBS&#125; ### Link boost libraries $&#123;log-lib&#125;) &ensp; Boost 주석 영역, 하단의 ### Link boost libraries 부분을 제외하면 기존에 생성이 되어 있던 부분이다. 위와 같이 추가함으로서 라이브러리를 프로젝트에 쉽게 링크할 수 있다. file(GLOB BOOST_LIBS ${BOOST_LIBS_PATH}/*.a) 코드는 해당 경로의 디렉토리에 있는 확장자 .a에 해당하는 모든 파일들을 참조할 수 있도록 도와준다. 수많은 파일들 이름을 일일이 입력하지 않고 쉽게 작업할 수 있다. 본 스크립트에서는 BOOST_LIBS 변수 안에 *.a에 해당하는 모든 파일들의 경로를 저장하고 있으며, 마지막 target_link_libraries를 실행하며 이를 사용하는 모습을 볼 수 있다. 프로젝트 ABI 버전 설정 &ensp;구버전의 Boost 라이브러리와 새로운 버전의 안드로이드를 사용할 경우 최신 기기에서는 위 설정이 제대로 작동하지 않을 수 있다. 이는 BOOST_LIBS_PATH 설정 시 ${ANDROID_ABI}부분으로 인해 arm64 ABI를 사용하려고 시도하기 때문이다. 문제를 해결하기 위해 빌드 시 armeabi-v7a를 사용하도록 강제한다. 이는 app의 gradle 파일에서 externalNativeBuild의 ndk 항목에 abiFilters를 ‘armeabi-v7a’로 설정하면 가능하다. 샘플 코드 작성&ensp; 여기까지 진행 됐으면 Boost 라이브러리를 사용할 준비는 끝난 것이다. 아래의 샘플 코드를 이용하면 Boost가 잘 적용되는지 확인할 수 있다. 아래의 코드 중 Boost 사용 부분은 공식 튜토리얼 중 Serialization 기본 샘플 코드를 참고했다.12345678910111213141516171819202122232425262728293031323334353637383940414243444546474849#include &lt;jni.h&gt;#include &lt;string&gt;#include &lt;fstream&gt;#include &lt;boost/archive/text_oarchive.hpp&gt;#include &lt;boost/archive/text_iarchive.hpp&gt;class gps_position&#123;private: friend class boost::serialization::access; template&lt;class Archive&gt; void serialize(Archive &amp;ar, const unsigned int version) &#123; ar &amp; degrees; ar &amp; minutes; ar &amp; seconds; &#125;public: int degrees; int minutes; float seconds; gps_position()&#123;&#125;; gps_position(int d, int m, float s) : degrees(d), minutes(m), seconds(s)&#123;&#125;;&#125;;extern \"C\"JNIEXPORT jstring JNICALLJava_com_devyh_boostforandroidexample_MainActivity_stringFromJNI(JNIEnv *env, jobject /* this */) &#123; const char* filename = \"/storage/emulated/0/seriTest.bin\"; std::ofstream ofs(filename); const gps_position g(35, 59, 24.567f); &#123; boost::archive::text_oarchive oa(ofs); oa &lt;&lt; g; &#125; gps_position newg; &#123; std::ifstream ifs(filename); boost::archive::text_iarchive ia(ifs); ia &gt;&gt; newg; &#125; std::string hello = \"Serialize a instance of custom class\"; return env-&gt;NewStringUTF(hello.c_str());&#125; 코드 실행 시 주의사항 위 예제는 디바이스에 파일을 저장하고 읽기 때문에 관련된 권한을 설정해야 합니다. AndroidManifest.xml 파일에 아래와 같은 퍼미션을 작성합니다. \\\\ 자동으로 권한을 묻는 코드를 작성하지 않았다면 수동으로 활성화해야 합니다. 샘플 프로젝트&ensp; 본 튜토리얼에 대한 샘플 프로젝트는 다음 링크에 있다. 잘 안되는 부분이나 문의 덧글에 대해서는 언제나 환영입니다. 하루 이내에 답변을 달아 드리도록 노력하겠습니다.","categories":[{"name":"Programming","slug":"Programming","permalink":"http://yoursite.com/categories/Programming/"},{"name":"Android","slug":"Programming/Android","permalink":"http://yoursite.com/categories/Programming/Android/"}],"tags":[{"name":"Android, NDK, Boost","slug":"Android-NDK-Boost","permalink":"http://yoursite.com/tags/Android-NDK-Boost/"}]},{"title":"포스팅 수정 쉽구만","slug":"second-post","date":"2018-03-06T14:45:50.000Z","updated":"2018-03-09T15:56:20.000Z","comments":true,"path":"2018/03/06/second-post/","link":"","permalink":"http://yoursite.com/2018/03/06/second-post/","excerpt":"","text":"Welcome to StackEdit!Hi! I’m your first Markdown file in StackEdit. If you want to learn about StackEdit, you can read me. If you want to play with Markdown, you can edit me. If you have finished with me, you can just create new files by opening the file explorer on the left corner of the navigation bar. FilesStackEdit stores your files in your browser, which means all your files are automatically saved locally and are accessible offline! Create files and foldersThe file explorer is accessible using the button in left corner of the navigation bar. You can create a new file by clicking the New file button in the file explorer. You can also create folders by clicking the New folder button. Switch to another fileAll your files are listed in the file explorer. You can switch from one to another by clicking a file in the list. Rename a fileYou can rename the current file by clicking the file name in the navigation bar or by clicking the Rename button in the file explorer. Delete a fileYou can delete the current file by clicking the Remove button in the file explorer. The file will be moved into the Trash folder and automatically deleted after 7 days of inactivity. Export a fileYou can export the current file by clicking Export to disk in the menu. You can choose to export the file as plain Markdown, as HTML using a Handlebars template or as a PDF. SynchronizationSynchronization is one of the biggest features of StackEdit. It enables you to synchronize any file in your workspace with other files stored in your Google Drive, your Dropbox and your GitHub accounts. This allows you to keep writing on other devices, collaborate with people you share the file with, integrate easily into your workflow… The synchronization mechanism takes place every minute in the background, downloading, merging, and uploading file modifications. There are two types of synchronization and they can complement each other: The workspace synchronization will sync all your files, folders and settings automatically. This will allow you to fetch your workspace on any other device. To start syncing your workspace, just sign in with Google in the menu. The file synchronization will keep one file of the workspace synced with one or multiple files in Google Drive, Dropbox or GitHub. Before starting to sync files, you must link an account in the Synchronize sub-menu. Open a fileYou can open a file from Google Drive, Dropbox or GitHub by opening the Synchronize sub-menu and clicking Open from. Once opened in the workspace, any modification in the file will be automatically synced. Save a fileYou can save any file of the workspace to Google Drive, Dropbox or GitHub by opening the Synchronize sub-menu and clicking Save on. Even if a file in the workspace is already synced, you can save it to another location. StackEdit can sync one file with multiple locations and accounts. Synchronize a fileOnce your file is linked to a synchronized location, StackEdit will periodically synchronize it by downloading/uploading any modification. A merge will be performed if necessary and conflicts will be resolved. If you just have modified your file and you want to force syncing, click the Synchronize now button in the navigation bar. Note: The Synchronize now button is disabled if you have no file to synchronize. Manage file synchronizationSince one file can be synced with multiple locations, you can list and manage synchronized locations by clicking File synchronization in the Synchronize sub-menu. This allows you to list and remove synchronized locations that are linked to your file. PublicationPublishing in StackEdit makes it simple for you to publish online your files. Once you’re happy with a file, you can publish it to different hosting platforms like Blogger, Dropbox, Gist, GitHub, Google Drive, WordPress and Zendesk. With Handlebars templates, you have full control over what you export. Before starting to publish, you must link an account in the Publish sub-menu. Publish a FileYou can publish your file by opening the Publish sub-menu and by clicking Publish to. For some locations, you can choose between the following formats: Markdown: publish the Markdown text on a website that can interpret it (GitHub for instance), HTML: publish the file converted to HTML via a Handlebars template (on a blog for example). Update a publicationAfter publishing, StackEdit keeps your file linked to that publication which makes it easy for you to re-publish it. Once you have modified your file and you want to update your publication, click on the Publish now button in the navigation bar. Note: The Publish now button is disabled if your file has not been published yet. Manage file publicationSince one file can be published to multiple locations, you can list and manage publish locations by clicking File publication in the Publish sub-menu. This allows you to list and remove publication locations that are linked to your file. Markdown extensionsStackEdit extends the standard Markdown syntax by adding extra Markdown extensions, providing you with some nice features. ProTip: You can disable any Markdown extension in the File properties dialog. SmartyPantsSmartyPants converts ASCII punctuation characters into “smart” typographic punctuation HTML entities. For example: ASCII HTML Single backticks &#39;Isn&#39;t this fun?&#39; ‘Isn’t this fun?’ Quotes &quot;Isn&#39;t this fun?&quot; “Isn’t this fun?” Dashes -- is en-dash, --- is em-dash – is en-dash, — is em-dash KaTeXYou can render LaTeX mathematical expressions using KaTeX: The Gamma function satisfying $\\Gamma(n) = (n-1)!\\quad\\forall n\\in\\mathbb N$ is via the Euler integral $$\\Gamma(z) = \\int_0^\\infty t^{z-1}e^{-t}dt\\,.$$ You can find more information about LaTeX mathematical expressions here. UML diagramsYou can render UML diagrams using Mermaid. For example, this will produce a sequence diagram: 123456789sequenceDiagramAlice -&gt;&gt; Bob: Hello Bob, how are you?Bob--&gt;&gt;John: How about you John?Bob--x Alice: I am good thanks!Bob-x John: I am good thanks!Note right of John: Bob thinks a long&lt;br/&gt;long time, so long&lt;br/&gt;that the text does&lt;br/&gt;not fit on a row.Bob--&gt;Alice: Checking with John...Alice-&gt;John: Yes... John, how are you? And this will produce a flow chart: 12345graph LRA[Square Rect] -- Link text --&gt; B((Circle))A --&gt; C(Round Rect)B --&gt; D&#123;Rhombus&#125;C --&gt; D","categories":[{"name":"Diary","slug":"Diary","permalink":"http://yoursite.com/categories/Diary/"},{"name":"일기","slug":"Diary/일기","permalink":"http://yoursite.com/categories/Diary/일기/"}],"tags":[{"name":"잡담","slug":"잡담","permalink":"http://yoursite.com/tags/잡담/"}]},{"title":"첫 글 테스트!","slug":"github-page-and-hexo","date":"2018-03-05T16:08:10.000Z","updated":"2018-03-05T16:09:12.000Z","comments":true,"path":"2018/03/06/github-page-and-hexo/","link":"","permalink":"http://yoursite.com/2018/03/06/github-page-and-hexo/","excerpt":"","text":"와 github page 첫 글이다!앞으로 열심히 써야지.","categories":[],"tags":[{"name":"첫글","slug":"첫글","permalink":"http://yoursite.com/tags/첫글/"}]},{"title":"Hello World","slug":"hello-world","date":"2018-03-05T15:43:17.000Z","updated":"2018-03-05T15:43:17.000Z","comments":true,"path":"2018/03/06/hello-world/","link":"","permalink":"http://yoursite.com/2018/03/06/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}]}